#include "delay.h"

#if (SYS_FOSC == FOSC_11059200)
/*********************************************
/*函数名称：Delay_ms(void)
/*函数功能：11.0592MHz工作频率下延时约1ms
/*输入参数：无
/*返回值：无
*********************************************/
void Delay_ms()		//@11.0592MHz
{
	unsigned char i, j;

	i = 15;
	j = 90;
	do
	{
		while (--j);
	} while (--i);
}

/*********************************************
/*函数名称：Delay_us(void)
/*函数功能：11.0592MHz工作频率下延时约1us
/*输入参数：无
/*返回值：无
*********************************************/
void Delay_us()		//@11.0592MHz
{
	unsigned char i;

	_nop_();
	_nop_();
	i = 1;
	while (--i);
}


#elif (SYS_FOSC == FOSC_22118400)
/*********************************************
/*函数名称：Delay_us(void)
/*函数功能：22.1184MHz工作频率下的延时1us
/*输入参数：无
/*返回值：无
*********************************************/
void Delay_us()		//@22.1184MHz
{
	unsigned char i;

	_nop_();
	i = 5;
	while (--i);
}

/*********************************************
/*函数名称：Delay_ms(void)
/*函数功能：22.1184MHz工作频率下延时约1ms
/*输入参数：无
/*返回值：无
*********************************************/
void Delay_ms()		//@22.1184MHz
{
	unsigned char i, j;

	i = 29;
	j = 183;
	do
	{
		while (--j);
	} while (--i);
}

#elif (SYS_FOSC == FOSC_24000000)
/*********************************************
/*函数名称：Delay_us(void)
/*函数功能：24MHz工作频率下的延时1us
/*输入参数：无
/*返回值：无
*********************************************/
void Delay_us()		//@24.000MHz
{
	unsigned char i;

	i = 6;
	while (--i);
}

/*********************************************
/*函数名称：Delay_ms(void)
/*函数功能：24MHz工作频率下延时约1ms
/*输入参数：无
/*返回值：无
*********************************************/
void Delay_ms()		//@24.000MHz
{
	unsigned char i, j;
	_nop_();
	i = 32;
	j = 40;
	do
	{
		while (--j);
	} while (--i);
}

#endif

/*********************************************
/*函数名称：Delay_xms(u16 i)
/*函数功能：工作频率下延时约x*1ms=x ms
/*输入参数：0~65535
/*返回值：无
*********************************************/
void Delay_xms(u16 i)
{
	u16 k;	
	for(k=0;k<i;k++)
	{
		Delay_ms();
	}
}

/*********************************************
/*函数名称：Delay_xus(u16 i)
/*函数功能：工作频率下延时约x*1us=x us
/*输入参数：0~65535
/*返回值：无
*********************************************/
void Delay_xus(u16 i)
{
	u16 k;	
	for(k=0;k<i;k++)
	{
		Delay_us();
	}
}