#include "adc.h"

/*****************************************************
/*函数名称：ADC_IO_Config()
/*函数功能：ADC端口配置函数
/*输入参数：无
/*返回值：	无
*****************************************************/
void ADC_IO_Config()
{
	P0M1 |= (1<<0);	P0M0 &= ~(1<<0);	//设置I/O端口为输入模式
}

/*****************************************************
/*ADC_Init()
/*函数功能：ADC配置函数
/*输入参数：模拟信号输入通道选择（0-7）
/*返回值：无
*****************************************************/
void ADC_Init()
{
	P_SW2 |= 0x80;		//扩展RAM区特殊功能寄存器访问控制寄存器，使能访问XFR
	//设置 ADC 内部时序, ADC 采样时间建议最大值
	//设置 ADC 通道选择时间占用1个 ADC 工作时钟
	//设置 ADC 通道选择保持时间占用2个 ADC 工作时钟
	//设置 ADC 模拟信号采样时间占用32个 ADC 工作时钟，SMPDUTY=11111B
	ADCTIM = 0x3f;
	P_SW2 &= 0x7f;
	//设置 ADC 转换结果右对齐
	//设置 ADC 工作时钟为系统时钟/2/(15+1)
	ADCCFG |= ADC_SPEED15 | ADC_RESFMTR;
	ADC_CONTR |= ADC_POWER; //使能 ADC 模块
	ADC_RES = 0;
	ADC_RESL = 0;
	Delay_xms(5);
}

/*****************************************************
/*函数名称：u16 Get_ADC10bitResult(u8 ch)
/*函数功能：查询法读一次ADC结果
/*输入参数：ch:模拟信号输入通道选择（0-15）
/*返回值：	10位ADC结果
*****************************************************/
u16 Get_ADC10bitResult(u8 ch)
{
	ADC_CONTR |= ADC_START ;	//启动 AD 转换
	Delay_xms(1);							//延时2ms
	ADC_CONTR |= ch;					//ADC通道选择
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	while((ADC_CONTR & ADC_FLAG) == 0);		//等待转换完成
	ADC_CONTR &= ~ADC_FLAG;								//转换完成标志位清0
	return  (((u16)ADC_RES << 8) | ADC_RESL);
}

